; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-24)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	city0 - city
	city1 - city
	city2 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl0)
	(at plane2 city0)
	(fuel-level plane2 fl4)
	(at plane3 city0)
	(fuel-level plane3 fl3)
	(at plane4 city2)
	(fuel-level plane4 fl6)
	(at plane5 city1)
	(fuel-level plane5 fl6)
	(at person1 city1)
	(at person2 city0)
	(at person3 city1)
	(at person4 city0)
	(at person5 city2)
	(at person6 city1)
	(at person7 city1)
	(at person8 city0)
	(at person9 city0)
	(at person10 city0)
	(at person11 city2)
	(at person12 city0)
	(at person13 city0)
	(at person14 city2)
	(at person15 city0)
	(at person16 city2)
	(at person17 city0)
	(at person18 city1)
	(at person19 city2)
	(at person20 city2)
	(at person21 city1)
	(at person22 city0)
	(at person23 city2)
	(at person24 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city1)
	(at plane4 city1)
	(at person1 city2)
	(at person2 city0)
	(at person3 city0)
	(at person4 city2)
	(at person5 city1)
	(at person6 city1)
	(at person7 city0)
	(at person8 city0)
	(at person9 city1)
	(at person10 city2)
	(at person11 city1)
	(at person12 city1)
	(at person13 city2)
	(at person14 city0)
	(at person15 city2)
	(at person16 city0)
	(at person17 city2)
	(at person18 city2)
	(at person19 city0)
	(at person20 city1)
	(at person21 city0)
	(at person22 city1)
	(at person23 city2)
	(at person24 city2)
	))

)

; plan
1. (board person7 plane5 city1)
   deleted: (at person7 city1)
   added: (in person7 plane5)
   goals met: 4 of 26
2. (board person3 plane5 city1)
   deleted: (at person3 city1)
   added: (in person3 plane5)
   goals met: 4 of 26
3. (board person24 plane5 city1)
   deleted: (at person24 city1)
   added: (in person24 plane5)
   goals met: 4 of 26
4. (board person21 plane5 city1)
   deleted: (at person21 city1)
   added: (in person21 plane5)
   goals met: 4 of 26
5. (zoom plane5 city1 city0 fl6 fl5 fl4)
   deleted: (at plane5 city1) (fuel-level plane5 fl6)
   added: (at plane5 city0) (fuel-level plane5 fl4)
   goals met: 4 of 26
6. (debark person7 plane5 city0)
   deleted: (in person7 plane5)
   added: (at person7 city0)
   goals met: 5 of 26
7. (debark person3 plane5 city0)
   deleted: (in person3 plane5)
   added: (at person3 city0)
   goals met: 6 of 26
8. (debark person21 plane5 city0)
   deleted: (in person21 plane5)
   added: (at person21 city0)
   goals met: 7 of 26
9. (zoom plane5 city0 city2 fl4 fl3 fl2)
   deleted: (at plane5 city0) (fuel-level plane5 fl4)
   added: (at plane5 city2) (fuel-level plane5 fl2)
   goals met: 7 of 26
10. (debark person24 plane5 city2)
   deleted: (in person24 plane5)
   added: (at person24 city2)
   goals met: 8 of 26
11. (zoom plane4 city2 city1 fl6 fl5 fl4)
   deleted: (at plane4 city2) (fuel-level plane4 fl6)
   added: (at plane4 city1) (fuel-level plane4 fl4)
   goals met: 9 of 26
12. (board person5 plane5 city2)
   deleted: (at person5 city2)
   added: (in person5 plane5)
   goals met: 9 of 26
13. (board person20 plane5 city2)
   deleted: (at person20 city2)
   added: (in person20 plane5)
   goals met: 9 of 26
14. (board person19 plane5 city2)
   deleted: (at person19 city2)
   added: (in person19 plane5)
   goals met: 9 of 26
15. (board person16 plane5 city2)
   deleted: (at person16 city2)
   added: (in person16 plane5)
   goals met: 9 of 26
16. (board person14 plane5 city2)
   deleted: (at person14 city2)
   added: (in person14 plane5)
   goals met: 9 of 26
17. (board person11 plane5 city2)
   deleted: (at person11 city2)
   added: (in person11 plane5)
   goals met: 9 of 26
18. (board person18 plane4 city1)
   deleted: (at person18 city1)
   added: (in person18 plane4)
   goals met: 9 of 26
19. (board person1 plane4 city1)
   deleted: (at person1 city1)
   added: (in person1 plane4)
   goals met: 9 of 26
20. (zoom plane4 city1 city2 fl4 fl3 fl2)
   deleted: (at plane4 city1) (fuel-level plane4 fl4)
   added: (at plane4 city2) (fuel-level plane4 fl2)
   goals met: 8 of 26
21. (debark person18 plane4 city2)
   deleted: (in person18 plane4)
   added: (at person18 city2)
   goals met: 9 of 26
22. (debark person1 plane4 city2)
   deleted: (in person1 plane4)
   added: (at person1 city2)
   goals met: 10 of 26
23. (zoom plane4 city2 city1 fl2 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl2)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 11 of 26
24. (zoom plane2 city0 city1 fl4 fl3 fl2)
   deleted: (at plane2 city0) (fuel-level plane2 fl4)
   added: (at plane2 city1) (fuel-level plane2 fl2)
   goals met: 12 of 26
25. (board person9 plane3 city0)
   deleted: (at person9 city0)
   added: (in person9 plane3)
   goals met: 12 of 26
26. (board person4 plane3 city0)
   deleted: (at person4 city0)
   added: (in person4 plane3)
   goals met: 12 of 26
27. (board person22 plane3 city0)
   deleted: (at person22 city0)
   added: (in person22 plane3)
   goals met: 12 of 26
28. (board person17 plane3 city0)
   deleted: (at person17 city0)
   added: (in person17 plane3)
   goals met: 12 of 26
29. (board person15 plane3 city0)
   deleted: (at person15 city0)
   added: (in person15 plane3)
   goals met: 12 of 26
30. (board person13 plane3 city0)
   deleted: (at person13 city0)
   added: (in person13 plane3)
   goals met: 12 of 26
31. (zoom plane3 city0 city2 fl3 fl2 fl1)
   deleted: (at plane3 city0) (fuel-level plane3 fl3)
   added: (at plane3 city2) (fuel-level plane3 fl1)
   goals met: 12 of 26
32. (debark person4 plane3 city2)
   deleted: (in person4 plane3)
   added: (at person4 city2)
   goals met: 13 of 26
33. (debark person17 plane3 city2)
   deleted: (in person17 plane3)
   added: (at person17 city2)
   goals met: 14 of 26
34. (debark person15 plane3 city2)
   deleted: (in person15 plane3)
   added: (at person15 city2)
   goals met: 15 of 26
35. (debark person13 plane3 city2)
   deleted: (in person13 plane3)
   added: (at person13 city2)
   goals met: 16 of 26
36. (fly plane3 city2 city1 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 16 of 26
37. (debark person9 plane3 city1)
   deleted: (in person9 plane3)
   added: (at person9 city1)
   goals met: 17 of 26
38. (debark person22 plane3 city1)
   deleted: (in person22 plane3)
   added: (at person22 city1)
   goals met: 18 of 26
39. (zoom plane5 city2 city0 fl2 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl2)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 18 of 26
40. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 18 of 26
41. (debark person19 plane5 city0)
   deleted: (in person19 plane5)
   added: (at person19 city0)
   goals met: 19 of 26
42. (debark person16 plane5 city0)
   deleted: (in person16 plane5)
   added: (at person16 city0)
   goals met: 20 of 26
43. (debark person14 plane5 city0)
   deleted: (in person14 plane5)
   added: (at person14 city0)
   goals met: 21 of 26
44. (fly plane5 city0 city1 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 21 of 26
45. (debark person5 plane5 city1)
   deleted: (in person5 plane5)
   added: (at person5 city1)
   goals met: 22 of 26
46. (debark person20 plane5 city1)
   deleted: (in person20 plane5)
   added: (at person20 city1)
   goals met: 23 of 26
47. (debark person11 plane5 city1)
   deleted: (in person11 plane5)
   added: (at person11 city1)
   goals met: 24 of 26
48. (zoom plane2 city1 city0 fl2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl2)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 23 of 26
49. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 23 of 26
50. (board person12 plane2 city0)
   deleted: (at person12 city0)
   added: (in person12 plane2)
   goals met: 23 of 26
51. (board person10 plane2 city0)
   deleted: (at person10 city0)
   added: (in person10 plane2)
   goals met: 23 of 26
52. (fly plane2 city0 city1 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 24 of 26
53. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 24 of 26
54. (debark person12 plane2 city1)
   deleted: (in person12 plane2)
   added: (at person12 city1)
   goals met: 25 of 26
55. (fly plane2 city1 city2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 24 of 26
56. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 24 of 26
57. (debark person10 plane2 city2)
   deleted: (in person10 plane2)
   added: (at person10 city2)
   goals met: 25 of 26
58. (fly plane2 city2 city1 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 26 of 26
